<%
'' USB로 로그인가능한 IP 목록 // USB 키가 생각보다 안전하지는 않음.
'' 유동등 자주 바뀌는 매장은 SMS 인증으로 유도하심이 좋을듯.
function IsUsbLoginAlowIp()
    dim icheck_UserIP : icheck_UserIP = request.ServerVariables("REMOTE_ADDR")
    dim i,buf1
    dim C_ALLOW_USB_IPLIST
    
''사내(대학로)  "115.94.163.42","115.94.163.43","115.94.163.44","115.94.163.45","115.94.163.46"
''대학로 매장   "175.123.149.94", "125.189.22.82"
'/ 221.155.223.196 일산	'/2018.04.11     "221.155.223.95","61.80.25.98", "220.87.53.83"
' 14.40.95.157 건대
'' 118.221.62.51 김포롯데	'/2017.06.21
''이대 엘큐브   "14.39.164.83", "118.33.41.76"
''부산          "218.146.160.217"
''115.91.233.123 물류 (3PL)
''물류          "203.84.251.209"
''물류          "115.91.233.126",
''물류          "115.93.29.60" 
''아이띵소 사무실  "222.111.223.217"
''대학로2층 ?   "114.201.204.109"
'211.53.55.89 DDP점	'/2017.12.19
'' 116.42.227.138 <= 124.58.8.230 <= 58.127.43.37 강희란 재택 임시 (2016/02/29)
'61.37.16.3 고양스타필드점	'/2017.08.18
' 112.171.18.242 이은주 재택

    C_ALLOW_USB_IPLIST = Array("115.94.163.42","115.94.163.43","115.94.163.44","115.94.163.45","115.94.163.46" _        
                        , "175.123.149.94", "125.189.22.82" _
                        , "116.42.227.138","221.155.223.95", "221.155.223.196", "61.80.25.98", "220.87.53.83" _ 
                        ,"14.40.95.157","211.46.21.145","211.53.55.89","115.91.233.124" _ 
                        ,"118.221.62.51", "118.221.62.51", "210.205.0.139" _
                        ,"14.39.164.83", "118.33.41.76" _
                        ,"218.146.160.217" _
                        ,"203.84.251.209" _ 
                        ,"115.91.233.126", "115.91.233.123","61.252.133.102"  _    
                        ,"115.93.29.60","61.37.16.3"   _       
                        ,"222.111.223.217" _ 
                        ,"114.201.204.109","112.171.18.242" _
                        )
    
    IsUsbLoginAlowIp = false
    for i=0 to UBound(C_ALLOW_USB_IPLIST)
        buf1 = C_ALLOW_USB_IPLIST(i)
        if (icheck_UserIP=buf1) then
            IsUsbLoginAlowIp = true
            Exit For
        end if
    next

    if (Not IPCheckOK) then
        ' 로그인 권한 IP 관리 DB화   ' 2019.09.20 한용민
        IsUsbLoginAlowIp = fncheckAllowIPWithByDB("Y", "", "")
    end if

    if (application("Svr_Info")="Dev") then
        IsUsbLoginAlowIp = (Left(icheck_UserIP,7)="192.168")
    end if
    
    ''61.252.133.1~126
    buf1 = replace(icheck_UserIP,".","")
    if (LEft(buf1,8)="61252133") then
        if (Mid(buf1,9,3)>0 and Mid(buf1,9,3)<127) then
            IsUsbLoginAlowIp = true
        end if
    end if
end function
%>